Repository: ppossanzini/esempivue
Catalog: openiddict-core-dev/src/OpenIddict.Abstractions/Resources/xlf/OpenIddictResources.*.xlf
Languages: it

# ID2000
source: The security token is missing.
it: Il token di sicurezza è mancante.

# ID2001
source: The specified authorization code is invalid.
it: Il codice di autorizzazione specificato non è valido.

# ID2002
source: The specified device code is invalid.
it: Il codice del dispositivo specificato non è valido.

# ID2003
source: The specified refresh token is invalid.
it: Il token di aggiornamento specificato non è valido.

# ID2004
source: The specified token is invalid.
it: Il token specificato non è valido.

# ID2005
source: The specified token is not an authorization code.
it: Il token specificato non è un codice di autorizzazione.

# ID2006
source: The specified token is not an device code.
it: Il token specificato non è un codice del dispositivo.

# ID2007
source: The specified token is not a refresh token.
it: Il token specificato non è un token di aggiornamento.

# ID2008
source: The specified token is not an access token.
it: Il token specificato non è un token di accesso.

# ID2009
source: The specified identity token is invalid.
it: Il token di identità specificato non è valido.

# ID2010
source: The specified authorization code has already been redeemed.
it: Il codice di autorizzazione specificato è già stato utilizzato.

# ID2011
source: The specified device code has already been redeemed.
it: Il codice di dispositivo specificato è già stato utilizzato.

# ID2012
source: The specified refresh token has already been redeemed.
it: Il token di aggiornamento specificato è già stato utilizzato.

# ID2013
source: The specified token has already been redeemed.
it: Il codice specificato è già stato utilizzato.

# ID2014
source: The authorization has not been granted yet by the end user.
it: L'autorizzazione non è ancora stata concessa dall'utente finale.

# ID2015
source: The authorization was denied by the end user.
it: L'autorizzazione è stata negata dall'utente finale.

# ID2016
source: The specified authorization code is no longer valid.
it: Il codice di autorizzazione specificato non è più valido.

# ID2017
source: The specified device code is no longer valid.
it: Il codice del dispositivo specificato non è più valido.

# ID2018
source: The specified refresh token is no longer valid.
it: Il token di aggiornamento specificato non è più valido.

# ID2019
source: The specified token is no longer valid.
it: Il token specificato non è più valido.

# ID2020
source: The authorization associated with the authorization code is no longer valid.
it: L'autorizzazione associata con il codice di autorizzazione non è più valida.

# ID2021
source: The authorization associated with the device code is no longer valid.
it: L'autorizzazione associata con il codice del dispositivo non è più valida.

# ID2022
source: The authorization associated with the refresh token is no longer valid.
it: L'autorizzazione associata con il token di aggiornamento non è più valida.

# ID2023
source: The authorization associated with the token is no longer valid.
it: L'autorizzazione associata con il token non è più valida.

# ID2024
source: The token request was rejected by the authentication server.
it: La richiesta del token è stata respinta dal server di autenticazione.

# ID2025
source: The user information access demand was rejected by the authentication server.
it: La richiesta di accesso alle informazioni dell'utente è stata rifiutata dal server di autenticazione.

# ID2026
source: The specified user code is no longer valid.
it: Il codice utente specificato non è più valido.

# ID2028
source: The '{0}' parameter is not supported.
it: Il parametro '{0}' non è supportato.

# ID2029
source: The mandatory '{0}' parameter is missing.
it: Manca il parametro obbligatorio '{0}'.

# ID2030
source: The '{0}' parameter must be a valid absolute URL.
it: Il parametro '{0}' deve essere un URL assoluto valido.

# ID2031
source: The '{0}' parameter must not include a fragment.
it: Il parametro '{0}' non deve includere un frammento di URL.

# ID2032
source: The specified '{0}' is not supported.
it: Il '{0}' specificato non è supportato.

# ID2033
source: The specified '{0}'/'{1}' combination is invalid.
it: La combinazione '{0}' / '{1}' specificata non è valida.

# ID2034
source: The mandatory '{0}' scope is missing.
it: Manca l'ambito obbligatorio '{0}'.

# ID2035
source: The '{0}' scope is not allowed.
it: L'ambito '{0}' non è consentito.

# ID2036
source: The client identifier cannot be null or empty.
it: L'identificatore del client non può essere nullo o vuoto.

# ID2037
source: The '{0}' parameter cannot be used without '{1}'.
it: Il parametro '{0}' non può essere utilizzato senza '{1}'.

# ID2038
source: The status cannot be null or empty.
it: Lo stato non può essere nullo o vuoto.

# ID2039
source: Scopes cannot be null or empty.
it: Gli ambiti non possono essere nulli o vuoti.

# ID2040
source: The '{0}' and '{1}' parameters can only be used with a response type containing '{2}'.
it: I parametri '{0}' e '{1}' possono essere utilizzati solo con un tipo di risposta contenente '{2}'.

# ID2041
source: The specified '{0}' is not allowed when using PKCE.
it: Il '{0}' specificato non è consentito quando si utilizza PKCE.

# ID2042
source: Scopes cannot contain spaces.
it: Gli ambiti non possono contenere spazi.

# ID2043
source: The specified '{0}' is not valid for this client application.
it: Il '{0}' specificato non è valido per questa applicazione client.

# ID2044
source: The scope name cannot be null or empty.
it: Il nome dell'ambito non può essere nullo o vuoto.

# ID2045
source: The scope name cannot contain spaces.
it: Il nome dell'ambito non può contenere spazi.

# ID2046
source: This client application is not allowed to use the authorization endpoint.
it: L'applicazione client non è autorizzata a utilizzare l'endpoint di autorizzazione.

# ID2047
source: The client application is not allowed to use the authorization code flow.
it: L'applicazione client non è autorizzata a utilizzare il flusso del codice di autorizzazione.

# ID2048
source: The client application is not allowed to use the implicit flow.
it: L'applicazione client non è autorizzata a utilizzare il flusso implicito.

# ID2049
source: The client application is not allowed to use the hybrid flow.
it: L'applicazione client non è autorizzata a utilizzare il flusso ibrido.

# ID2051
source: This client application is not allowed to use the specified scope.
it: L'applicazione client non è autorizzata a utilizzare l'ambito specificato.

# ID2052
source: The specified '{0}' is invalid.
it: Il '{0}' specificato non è valido.

# ID2053
source: The '{0}' parameter is not valid for this client application.
it: Il parametro '{0}' non è valido per questa applicazione client.

# ID2054
source: The '{0}' parameter required for this client application is missing.
it: Manca il parametro '{0}' richiesto per questa applicazione client.

# ID2055
source: The specified client credentials are invalid.
it: Le credenziali client specificate non sono valide.

# ID2056
source: This client application is not allowed to use the device endpoint.
it: L'applicazione client non è autorizzata a utilizzare l'endpoint del dispositivo.

# ID2057
source: The '{0}' and '{1}' parameters are required when using the client credentials grant.
it: I parametri '{0}' e '{1}' sono obbligatori quando si utilizza la concessione delle credenziali del client.

# ID2058
source: The '{0}' parameter is required when using the device code grant.
it: Il parametro '{0}' è obbligatorio quando si utilizza la concessione del codice del dispositivo.

# ID2059
source: The mandatory '{0}' and/or '{1}' parameters are missing.
it: Mancano i parametri obbligatori '{0}' e / o '{1}'.

# ID2060
source: A scope with the same name already exists.
it: Esiste già un ambito con lo stesso nome.

# ID2063
source: This client application is not allowed to use the token endpoint.
it: L'applicazione client non è autorizzata a utilizzare l'endpoint del token.

# ID2064
source: This client application is not allowed to use the specified grant type.
it: L'applicazione client non è autorizzata a utilizzare il tipo di concessione specificato.

# ID2065
source: The client application is not allowed to use the '{0}' scope.
it: L'applicazione client non può utilizzare l'ambito '{0}'.

# ID2066
source: The specified authorization code cannot be used without sending a client identifier.
it: Il codice di autorizzazione specificato non può essere utilizzato senza inviare un identificativo client.

# ID2067
source: The specified device code cannot be used without sending a client identifier.
it: Il codice dispositivo specificato non può essere utilizzato senza inviare un identificativo client.

# ID2068
source: The specified refresh token cannot be used without sending a client identifier.
it: Il token di aggiornamento specificato non può essere utilizzato senza inviare un identificatore client.

# ID2069
source: The specified authorization code cannot be used by this client application.
it: Il codice di autorizzazione specificato non può essere utilizzato da questa applicazione client.

# ID2070
source: The specified device code cannot be used by this client application.
it: Il codice del dispositivo specificato non può essere utilizzato da questa applicazione client.

# ID2071
source: The specified refresh token cannot be used by this client application.
it: Il token di aggiornamento specificato non può essere utilizzato da questa applicazione client.

# ID2072
source: The specified '{0}' parameter doesn't match the client redirection address the authorization code was initially sent to.
it: Il parametro '{0}' specificato non corrisponde all'indirizzo di reindirizzamento del client a cui è stato inizialmente inviato il codice di autorizzazione.

# ID2073
source: The '{0}' parameter cannot be used when no '{1}' was specified in the authorization request.
it: Il parametro '{0}' non può essere utilizzato se non è stato specificato alcun '{1}' nella richiesta di autorizzazione.

# ID2074
source: The '{0}' parameter is not valid in this context.
it: Il parametro '{0}' non è valido in questo contesto.

# ID2075
source: This client application is not allowed to use the introspection endpoint.
it: L'applicazione client non può utilizzare l'endpoint di introspezione.

# ID2076
source: The specified token cannot be introspected.
it: Il token specificato non può essere esaminato.

# ID2077
source: The client application is not allowed to introspect the specified token.
it: L'applicazione client non è autorizzata a esaminare il token specificato.

# ID2078
source: This client application is not allowed to use the revocation endpoint.
it: L'applicazione client non è autorizzata a utilizzare l'endpoint di revoca.

# ID2079
source: This token cannot be revoked.
it: Questo token non può essere revocato.

# ID2080
source: The client application is not allowed to revoke the specified token.
it: L'applicazione client non è autorizzata a revocare il token specificato.

# ID2081
source: The mandatory '{0}' header is missing.
it: Manca l'intestazione '{0}' obbligatoria.

# ID2082
source: The specified '{0}' header is invalid.
it: L'intestazione '{0}' specificata non è valida.

# ID2083
source: This server only accepts HTTPS requests.
it: Questo server accetta solo richieste HTTPS.

# ID2084
source: The specified HTTP method is not valid.
it: Il metodo HTTP specificato non è valido.

# ID2085
source: A token with the same reference identifier already exists.
it: Esiste già un token con lo stesso identificatore di riferimento.

# ID2086
source: The token type cannot be null or empty.
it: Il tipo di token non può essere nullo o vuoto.

# ID2087
source: Multiple client credentials cannot be specified.
it: Non è possibile specificare più credenziali client.

# ID2088
source: The issuer associated to the specified token is not valid.
it: L'emittente associato al token specificato non è valido.

# ID2089
source: The specified token is not of the expected type.
it: Il token specificato non è del tipo previsto.

# ID2090
source: The signing key associated to the specified token was not found.
it: La chiave di firma associata al token specificato non è stata trovata.

# ID2091
source: The signature associated to the specified token is not valid.
it: La firma associata al token specificato non è valida.

# ID2092
source: This resource server is currently unavailable.
it: Questo server di risorse non è attualmente disponibile.

# ID2093
source: The specified token doesn't contain any audience.
it: Il token specificato non contiene alcun pubblico.

# ID2094
source: The specified token cannot be used with this resource server.
it: Il token specificato non può essere utilizzato con questo server di risorse.

# ID2095
source: The user represented by the token is not allowed to perform the requested action.
it: L'utente rappresentato dal token non è autorizzato a eseguire l'azione richiesta.

# ID2096
source: No issuer could be found in the server configuration.
it: Nessun emittente è stato trovato nella configurazione del server.

# ID2097
source: A server configuration containing an invalid issuer was returned.
it: È stata restituita una configurazione del server contenente un emittente non valido.

# ID2098
source: The issuer returned in the server configuration is not valid.
it: L'emittente restituito nella configurazione del server non è valido.

# ID2099
source: No JWKS endpoint could be found in the server configuration.
it: Nessun endpoint JWKS è stato trovato nella configurazione del server.

# ID2100
source: A server configuration containing an invalid JWKS endpoint URL was returned.
it: È stata restituita una configurazione server contenente un URL dell'endpoint JWKS non valido.

# ID2101
source: A server configuration containing an invalid introspection endpoint URL was returned.
it: È stata restituita una configurazione del server contenente un URL dell'endpoint di introspezione non valido.

# ID2102
source: The JWKS document didn't contain a valid '{0}' node with at least one key.
it: Il documento JWKS non conteneva un nodo '{0}' valido con almeno una chiave.

# ID2103
source: A JWKS response containing an unsupported key was returned.
it: È stata restituita una risposta JWKS contenente una chiave non supportata.

# ID2104
source: A JWKS response containing an invalid key was returned.
it: È stata restituita una risposta JWKS contenente una chiave non valida.

# ID2105
source: The mandatory '{0}' parameter couldn't be found in the introspection response.
it: Impossibile trovare il parametro obbligatorio '{0}' nella risposta di introspezione.

# ID2106
source: The token was rejected by the remote authentication server.
it: Il token è stato rifiutato dal server di autenticazione remoto.

# ID2107
source: The '{0}' claim is malformed or isn't of the expected type.
it: La rivendicazione '{0}' non è valida o non è del tipo previsto.

# ID2108
source: An introspection response containing a malformed issuer was returned.
it: È stata restituita una risposta di introspezione contenente un emittente non valido.

# ID2109
source: The issuer returned in the introspection response is not valid.
it: L'emittente restituito nella risposta di introspezione non è valido.

# ID2110
source: The type of the introspected token doesn't match the expected type.
it: Il tipo di token analizzato non corrisponde al tipo previsto.

# ID2111
source: An application with the same client identifier already exists.
it: Esiste già un'applicazione con lo stesso identificatore client.

# ID2112
source: Only confidential, hybrid or public applications are supported by the default application manager.
it: Solo le applicazioni riservate, ibride o pubbliche sono supportate dal gestore applicazioni predefinito.

# ID2113
source: The client secret cannot be null or empty for a confidential application.
it: Il segreto client non può essere nullo o vuoto per un'applicazione riservata.

# ID2114
source: A client secret cannot be associated with a public application.
it: Un segreto client non può essere associato a un'applicazione pubblica.

# ID2115
source: Callback URLs cannot contain a fragment.
it: Gli URL di richiamata non possono contenere un frammento.

# ID2116
source: The authorization type cannot be null or empty.
it: Il tipo di autorizzazione non può essere nullo o vuoto.

# ID2117
source: The specified authorization type is not supported by the default token manager.
it: Il tipo di autorizzazione specificato non è supportato dal gestore di token predefinito.

# ID2118
source: The client type cannot be null or empty.
it: Il tipo di client non può essere nullo o vuoto.

# ID2119
source: Callback URLs cannot be null or empty.
it: Gli URL di richiamata non possono essere nulli o vuoti.

# ID2120
source: Callback URLs must be valid absolute URLs.
it: Gli URL di richiamata devono essere URL assoluti validi.

# ID8000
source: Removes orphaned tokens and authorizations from the database.
it: Rimuove i token e le autorizzazioni orfani dal database.

# ID8001
source: Starts the scheduled task at regular intervals.
it: Avvia l'attività pianificata a intervalli regolari.
